openFoam/flow_over_flatplate/0/.svn/all-wcprops
K 25
svn:wc:ra_dav:version-url
V 113
/svnroot/openfoam-extend/!svn/ver/349/trunk/Core/OpenFOAM-1.4.1-dev/tutorials/conjugateHeatFoam/conjugateCavity/0
END
p
K 25
svn:wc:ra_dav:version-url
V 115
/svnroot/openfoam-extend/!svn/ver/349/trunk/Core/OpenFOAM-1.4.1-dev/tutorials/conjugateHeatFoam/conjugateCavity/0/p
END
T
K 25
svn:wc:ra_dav:version-url
V 115
/svnroot/openfoam-extend/!svn/ver/349/trunk/Core/OpenFOAM-1.4.1-dev/tutorials/conjugateHeatFoam/conjugateCavity/0/T
END
U
K 25
svn:wc:ra_dav:version-url
V 115
/svnroot/openfoam-extend/!svn/ver/349/trunk/Core/OpenFOAM-1.4.1-dev/tutorials/conjugateHeatFoam/conjugateCavity/0/U
END
DT
K 25
svn:wc:ra_dav:version-url
V 116
/svnroot/openfoam-extend/!svn/ver/349/trunk/Core/OpenFOAM-1.4.1-dev/tutorials/conjugateHeatFoam/conjugateCavity/0/DT
END
solid
K 25
svn:wc:ra_dav:version-url
V 119
/svnroot/openfoam-extend/!svn/ver/349/trunk/Core/OpenFOAM-1.4.1-dev/tutorials/conjugateHeatFoam/conjugateCavity/0/solid
END
