openFoam/flow_over_flatplate/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |    
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0; 
    format      ascii;
    class       volVectorField;
    object      U;   
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.2 0 0);

boundaryField
{
    top
    {
        type            fixedValue;
	value           uniform (0.2 0 0);
    }
    inlet
    {
        type            fixedValue;
	value           uniform (0.2 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    plate
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    symmBound
    {
	type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
