openFoam/flow_over_flatplate/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |    
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0; 
    format      ascii;
    class       volScalarField;
    object      p;   
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //   


dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            zeroGradient;
    }

    inlet    
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
	value		uniform 0;
    }
    plate
    {
        type            zeroGradient;
    }
    symmBound
    {
	type		zeroGradient;
    }
    frontAndBack    
    {
        type            empty;
    }
}


// ************************************************************************* //
