openFoam/flow_over_flatplate/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 0)    //0
    (35 0 0)   //1
    (35 10 0)  //2
    (0 10 0)   //3
    (0 0 1)    //4
    (35 0 1)   //5
    (35 10 1)  //6
    (0 10 1)   //7
    (0 100 0)  //8
    (35 100 0) //9
    (0 100 1)  //10
    (35 100 1) //11
    (-20 0 0)  //12
    (-20 0 1)  //13
    (-20 10 0) //14
    (-20 10 1) //15
    (-20 100 0) //16
    (-20 100 1)	//17
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (35 30 1) simpleGrading (6 10 1)
    hex (3 2 9 8 7 6 11 10) (35 15 1) simpleGrading (6 3 1)
    hex (12 0 3 14 13 4 7 15) (20 30 1) simpleGrading (.1 10 1)
    hex (14 3 8 16 15 7 10 17) (20 15 1) simpleGrading (.1 3 1)
);

edges           
(
);

boundary
(
 top
 {
   type patch;
   faces
   (
        (8 9 11 10)
	(16 8 10 17)
   ); 
 }

 inlet
 {
    type patch; 
    faces 
    (
        (14 16 17 15)
	(12 14 15 13)
    );
 }

 outlet
 {
 type patch; 
  faces 
    (
        (9 2 6 11)
	(2 1 5 6)
    ); 
 }

 plate
 {
 type wall ;
 faces 
 (
	(0 4 5 1)
 ) ;
 }

 symmBound 
 {
 type patch; 
    faces
    (
	(12 13 4 0)
    ); 
 }

 frontAndBack
 {
 type empty;
    faces
    (
        (3 0 1 2)
        (7 6 5 4)
	(8 3 2 9)
	(10 11 6 7)
	(14 12 0 3)
	(15 7 4 13)
	(16 14 3 8)
	(17 10 7 15)
    ); 
  }
);

mergePatchPairs 
(
);


// ************************************************************************* //
